Ran Plan for 3 projects:

1. dir: `Project_1` workspace: `default`
1. dir: `Project_2` workspace: `default`
1. dir: `.` workspace: `default`

### 1. dir: `Project_1` workspace: `default`
<details><summary>Show Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.vm_creation[0].google_compute_instance.vm1 will be created
+ resource "google_compute_instance" "vm1" {
      + allow_stopping_for_update = true
      + can_ip_forward            = false
      + cpu_platform              = (known after apply)
      + creation_timestamp        = (known after apply)
      + current_status            = (known after apply)
      + deletion_protection       = false
      + effective_labels          = {
          + "goog-terraform-provisioned" = "true"
        }
      + id                        = (known after apply)
      + instance_id               = (known after apply)
      + label_fingerprint         = (known after apply)
      + machine_type              = "e2-standard-4"
      + metadata                  = {
          + "ssh-keys" = <<-EOT
                ssh-rsa 
                AAAAB3NzaC1yc2EAAAADAQABAAABgQCu1kG/UljpG9oZ6HyUSEcLnNuKorBEpkmxTcKSTtkIIUxl2yfkEk8k0QBiRm1ZNvYPjcQOa+aa7JSTQZ7eMJ8fxEel76obUZ8LLFicOp1EGQZEfH7sZuNSBjPeA8GGsFeRbiLooUxfVx+RsVw1VfGVdNuukPpbeOEFgH/AZiSYLTvgedtP6wsbpJgdV5KAkecZYjhWVEY6Yz43o9VhYA24rpKaeoxAzkasDXzTCPr2OknbmjJ7unCAgwJxT47nWI43PNsia1QROW5KVXN0FIxJmJ5UJUyYcIkAFIHsvkLXldyLzlZ4UEf88SKzf307DAT2m+DQqoNOPeQ09mJmowQL6c/rfnChsAhPDEEgpxWh63w8pmS5KZJVgr1Xz5/9Cvyk+lEUArgCAQAX7usQ3E4kRVHEXYfDPtOD3RM6Z1Imm/Tlc66Dnle4uSVg0rwp5IT1511G00HpXgVhbQYW8vBm2mWtCq/4uZGym6PvbzbpGVZ4j14qItQJ/1MpX8XBYPs= rocky
            EOT
        }
      + metadata_fingerprint      = (known after apply)
      + min_cpu_platform          = (known after apply)
      + name                      = "gcloud-vm-using-atlantis-p1"
      + project                   = "terraform-gcp-463406"
      + self_link                 = (known after apply)
      + tags                      = [
          + "http-server",
          + "https-server",
          + "ssh",
        ]
      + tags_fingerprint          = (known after apply)
      + terraform_labels          = {
          + "goog-terraform-provisioned" = "true"
        }
      + zone                      = "asia-southeast1-a"

      + boot_disk {
          + auto_delete                = true
          + device_name                = (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + guest_os_features          = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)

          + initialize_params {
              + architecture           = (known after apply)
              + image                  = "rocky-linux-9-v20250611"
              + labels                 = (known after apply)
              + provisioned_iops       = (known after apply)
              + provisioned_throughput = (known after apply)
              + resource_policies      = (known after apply)
              + size                   = 20
              + snapshot               = (known after apply)
              + type                   = (known after apply)
            }
        }

      + confidential_instance_config {
          + confidential_instance_type  = (known after apply)
          + enable_confidential_compute = (known after apply)
        }

      + guest_accelerator {
          + count = (known after apply)
          + type  = (known after apply)
        }

      + network_interface {
          + internal_ipv6_prefix_length = (known after apply)
          + ipv6_access_type            = (known after apply)
          + ipv6_address                = (known after apply)
          + name                        = (known after apply)
          + network                     = "default"
          + network_attachment          = (known after apply)
          + network_ip                  = (known after apply)
          + stack_type                  = (known after apply)
          + subnetwork                  = (known after apply)
          + subnetwork_project          = (known after apply)

          + access_config {
              + nat_ip       = (known after apply)
              + network_tier = (known after apply)
            }
        }

      + reservation_affinity {
          + type = (known after apply)

          + specific_reservation {
              + key    = (known after apply)
              + values = (known after apply)
            }
        }

      + scheduling {
          + automatic_restart           = (known after apply)
          + availability_domain         = (known after apply)
          + instance_termination_action = (known after apply)
          + min_node_cpus               = (known after apply)
          + on_host_maintenance         = (known after apply)
          + preemptible                 = (known after apply)
          + provisioning_model          = (known after apply)
          + termination_time            = (known after apply)

          + local_ssd_recovery_timeout {
              + nanos   = (known after apply)
              + seconds = (known after apply)
            }

          + max_run_duration {
              + nanos   = (known after apply)
              + seconds = (known after apply)
            }

          + node_affinities {
              + key      = (known after apply)
              + operator = (known after apply)
              + values   = (known after apply)
            }

          + on_instance_stop_action {
              + discard_local_ssd = (known after apply)
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d Project_1`
* :put_litter_in_its_place: To **delete** this plan click [here](http://d03477dc3ffd:4141/lock?id=yashwanthm998%252Fatlantis%252FProject_1%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d Project_1`
</details>
Plan: 1 to add, 0 to change, 0 to destroy.

---
### 2. dir: `Project_2` workspace: `default`
```diff

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d Project_2`
* :put_litter_in_its_place: To **delete** this plan click [here](http://d03477dc3ffd:4141/lock?id=yashwanthm998%252Fatlantis%252FProject_2%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d Project_2`

---
### 3. dir: `.` workspace: `default`
```diff

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d .`
* :put_litter_in_its_place: To **delete** this plan click [here](http://d03477dc3ffd:4141/lock?id=yashwanthm998%252Fatlantis%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d .`

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
